grevaillot/svd_tools/headers/STM32F7x2/otg_hs_host.h
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_BBERRM Babble error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_TXERRM Transaction error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_NYET response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK0_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz0 OTGHSHCTSIZ0 OTG_HS host channel-11 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ0_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz0_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz0_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma0 OTGHSHCDMA0 OTG_HS host channel-0 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA0_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA0_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma0_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar1 OTGHSHCCHAR1 OTG_HS host channel-1 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR1_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR1_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR1_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR1_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR1_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR1_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR1_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR1_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar1_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR1_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR1_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar1_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar1_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR1_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR1_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR1_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar1_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR1_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR1_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar1_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt1 OTGHSHCSPLT1 OTG_HS host channel-1 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT1_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT1_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT1_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT1_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt1_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT1_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT1_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt1_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT1_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT1_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt1_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint1 OTGHSHCINT1 OTG_HS host channel-1 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT1_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT1_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT1_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT1_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT1_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT1_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT1_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT1_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT1_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT1_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT1_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT1_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT1_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT1_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT1_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT1_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT1_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT1_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT1_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT1_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT1_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk1 OTGHSHCINTMSK1 OTG_HS host channel-1 interrupt mask register
@{*/

