grevaillot/svd_tools/headers/STM32F7x2/otg_hs_host.h
/** @defgroup otg_hs_host_otg_hs_hcdma13 OTGHSHCDMA13 OTG_HS host channel-13 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA13_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA13_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma13_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar14 OTGHSHCCHAR14 OTG_HS host channel-14 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR14_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR14_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR14_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR14_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR14_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR14_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR14_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR14_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar14_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR14_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR14_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar14_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR14_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR14_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar14_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR14_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR14_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR14_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR14_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR14_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR14_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar14_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR14_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR14_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar14_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt14 OTGHSHCSPLT14 OTG_HS host channel-14 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT14_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT14_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT14_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT14_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt14_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT14_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT14_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt14_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT14_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT14_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt14_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint14 OTGHSHCINT14 OTG_HS host channel-14 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT14_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT14_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT14_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT14_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT14_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT14_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT14_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT14_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT14_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT14_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT14_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT14_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT14_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT14_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT14_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT14_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT14_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT14_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT14_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT14_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT14_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT14_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk14 OTGHSHCINTMSK14 OTG_HS host channel-14 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK14_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_BBERRM Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_TXERRM Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_ACKM ACKM response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_NAKM NAKM response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK14_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK14_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz14 OTGHSHCTSIZ14 OTG_HS host channel-14 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ14_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ14_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz14_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz14_pktcnt PKTCNT Packet count
@{*/
/**@}*/


